export const pivotArray = [
    {
        caption: "اجرت ساخت",
        filterTextForPivot: [
            "اجرت ساخت",
            // "اجرت ساخت استیل حروف عادی",
            // "اجرت ساخت استیل حروف های سخت",
            // "اجرت ساخت چلنیوم حروف عادی",
            // "اجرت ساخت حروف سوئدی  آسان",
            // "اجرت ساخت نئون پلاستیک ( حروف استاندارد ) لبه 3 تا 8 سانت",
            // "اجرت ساخت نئون فلکس ( حروف آسان )",
            // "اجرت ساخت نئون فلکس ( حروف سخت )",
            // "اجرت ساخت نئون فلکس ( لوگو و طرح آسان )",
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "ترانس",
        filterTextForPivot: [
            "ترانس 200وات",
            "ترانس 300وات",
            "ترانس 400وات",

        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
        showSubitems: true,
        subRowKey: "myContactTitle",
        subRowValue: "myQuantity"
    },
    {
        caption: "SMD",
        filterTextForPivot: [
            "SMD آفتابی با سیم کشی و منگنه",
            "SMD سفید با سیم کشی و منگنه",
            "SMD قرمز با سیم کشی و منگنه",
            "SMD انبه ای با سیم کشی و منگنه",
            "اینجکشن آفتابی با سیم کشی و منگنه",
            "اینجکشن سفید با سیم کشی و منگنه",
            "اینجکشن قرمز با سیم کشی و منگنه",
            "اینجکشن انبه ای با سیم کشی و منگنه",
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "پلکسی",
        filterTextForPivot: [
            "پلکسی آبی آسمانی 2.8 میل کد 835",
            "پلکسی آبی کاربنی 2.8 میل کد 327",
            "پلکسی پیلاری 2.8 میل کد 238",
            "پلکسی پیلاری 2.8 میل کد245",
            "پلکسی دوغی 5میل",
            "پلکسی زیمنسی 2.8 میل کد 844",
            "پلکسی سبز 2.8 میل کد 348",
            "پلکسی سبز 2.8 میل کد 617",
            "پلکسی سفید 2.8 میل کد 433",
            "پلکسی شیشه ای شفاف 2.8 میل کد 0",
            "پلکسی صورتی 2.8 میل کد 100",
            "پلکسی طلایی آینه ای",
            "پلکسی قرمز  2.8 میل کد 136",
            "پلکسی مشکی 2.8 میل کد 502",
            "پلکسی نارنجی 2.8 میل کد 266",
            "پی وی سی ده میل",

        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "چلنیوم",
        filterTextForPivot: [
            "چلنیوم  مشکی 9 سانت ساده",
            "چلنیوم  مشکی سوپر ساید",
            "چلنیوم سفید 9 سانت ساده",
            "چلنیوم طلایی 7 سانت پانچ",
            "چلنیوم طلایی 9 سانت پانچ",
            "چلنیوم طلایی 9سانت ساده",
            "چلنیوم طلایی سوپر ساید",
            "چلنیوم مشکی 9 سانت پانچ",
            "چلنیوم نقره ای  7 سانت ساده",
            "چلنیوم نقره ای 9 سانت پانچ",
            "چلنیوم نقره ای 9سانت ساده",
            "چلنیوم نقره ای سوپر ساید",
            "لبه سوئدی طلایی خشدار  7 سانت",
            "لبه سوئدی مشکی 7 سانت",
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "لبه پلاستیک",
        filterTextForPivot: [
            "لبه پلاستیک"
        ],
        myKey: "myItemName",
        showSubitems: true,
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "ورق",
        filterTextForPivot: [
            // "ورق استیل طلایی",
            // "ورق آهن",
            // "ورق استیل نقره ای",
            // "ورق استیل دودی",
            // "ورق استیل مسی",
            // "ورق مشکی 2.5 میل",
            // "ورق مشکی ۲/۵ میل",
            // "ورق دودی آینه ای 1 میل",
            // "ورق دودی آینه ای ۱ میل",
            // "ورق",
            // "ورق",
            'ورق آهن 1 یک میل ابعاد 120 * 240',
            'ورق استیل طلایی آینه ای 7 دهم میل  کد 304 ابعاد 120*240',
            'ورق استیل طلایی اینه ای 1 میل کد 304 ابعاد 120*240',
            'ورق استیل طلایی خشدار 7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل طلایی خشدار 1 میل کد 304 ابعاد 120*240',
            'ورق استیل نقره ای آینه ای  7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل نقره ای اینه ای 1 میل کد 304 ابعاد 120*240',
            'ورق استیل نقره ای خشدار 7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل نقره ای خشدار  1 میل کد 304 ابعاد 120*240',
            'ورق استیل دودی اینه ای 7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل دودی اینه ای 1 میل کد 304 ابعاد 120*240',
            'ورق استیل دودی خشدار 7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل دودی خشدار  1 میل کد 304 ابعاد 120*240',
            'ورق استیل مسی ( رزگلد ) اینه ای 7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل مسی ( رزگلد ) اینه ای 1 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل مسی ( رزگلد ) خشدار 7 دهم میل کد 304 ابعاد 120*240',
            'ورق استیل مسی ( رزگلد ) خشدار 1 میل کد 304 ابعاد 120*240',
            'ورق آهن 1/5 یک و نیم میل ابعاد 120 * 240',
            'ورق آهن 0/8 میل ابعاد 120*240',
            'ورق 1 میل کالوانیزه',
            'ورق 1.2 میل روغنی',
            'ورق استیل طلایی آینه ای 0/5',
            'ورق استیل طلایی خشدار 0/5',
            'ورق استیل طلایی خشدار 0/6',
            'ورق استیل دودی آینه ای 0/5',
            'ورق مشکی 2/5 میل',
            'ورق استیل نقره ای خشدار 0/5 دهم',
            'ورق استیل عرض 1 cm',
            'ورق استیل عرض 2 cm',
            'ورق استیل عرض 3 cm',
            'ورق استیل عرض 5 و 7 cm',
            'ورق استیل عرض 7 cm',
            'ورق استیل نقره ای آینه ای 0/5 میل',
            'ورق استیل مسی خشدار /06 میل',
            '000167 - ورق استیل دودی خشدار 5 دهم میل کد 304 ابعاد 120*240',
            'ورق دودی آینه ای 1 میل',
            'ورق آهن 1/25 یک و بیست و پنج میل ابعاد 120 * 240 -',
            'ورق استیل مسی 0/6 دهم',
            'ورق استیل مسی 0/6 دهم خشدار',
            'ورق استیل طلایی 0/5 دهم',
            'ورق استیل دودی خشدار 0/6 دهم',
            'ورق آهن 2 دو میل ابعاد 120 * 240',
            'ورق آهن 0.5  میل ابعاد 120 * 240',
            'ورق استیل نقره ای خشدار 0/8 دهم',
            'ورق استیل نقره ای آینه ای  6 دهم میل کد 304 ابعاد 120*240',

        ],
        myKey: "myItemName",
        // showSubitems: true,
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "پی وی سی",
        filterTextForPivot: [
            "پی وی سی ده میل"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },

]


export const ttt = [
    {
        caption: "پلکسی 2.8",
        filterTextForPivot: [
            "اجرت برش لیزر ورق 2.8 میل"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "پانچ ساده",
        filterTextForPivot: [
            "اجرت پانچی کردن ( حالت ساده ) طلق 2.8 میل"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "پانچ طرح دار",
        filterTextForPivot: [
            "اجرت پانچی کردن ( حالت طرحدار ) طلق 2.8 میل"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "دوبل",
        filterTextForPivot: [
            "اجرت دوبل همراه با مبلغ کلر فرم"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },

    {
        caption: "دوغی 10 میل",
        filterTextForPivot: [
            "اجرت برش لیزر پلکسی 10 میل"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "دوغی 5 میل",
        filterTextForPivot: [
            "اجرت برش لیزر پلکسی 5 میل"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "استیل و فلز",
        filterTextForPivot: [
            "استیل و فلز",
            "اجرت ساخت استیل حروف های سخت",
            "اجرت ساخت جوش فایبر",
            "اجرت ساخت لبه یک تیکه ( دوطرفه ) جوش فایبر",
            "اجرت ساخت حروف آهن",
            "اجرت ساخت استیل حروف عادی"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },

    {
        caption: "چلنیوم و سوئدی",
        filterTextForPivot: [
            "اجرت ساخت چلنیوم",
            "اجرت ساخت حروف سوئدی",
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },

    {
        caption: " نئون پلاستیک",
        filterTextForPivot: [
            "اجرت ساخت نئون پلاستیک ( حروف استاندارد ) لبه ۳ تا ۸ سانت",
            "اجرت ساخت نئون پلاستیک ( حروف سخت) لبه ۳ تا ۸ سانت",
            "اجرت ساخت نئون پلاستیک ( حروف استاندارد ) لبه 3 تا 8 سانت",
            "اجرت ساخت نئون پلاستیک ( حروف سخت) لبه 3 تا 8 سانت",
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },

    {
        caption: "نئون فلکسی",
        filterTextForPivot: [
            // "اجرت ساخت نئون فلکس ( حروف آسان )",
            // "اجرت ساخت نئون فلکس ( حروف سخت )",
            // "اجرت ساخت نئون فلکس ( لوگو و طرح آسان )",
            // "اجرت ساخت نئون فلکس ( لوگو و طرح سخت )",
            "اجرت ساخت نئون فلکس ",
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
    {
        caption: "لبه پلاستیک",
        filterTextForPivot: [
            "لبه پلاستیک"
        ],
        myKey: "myItemName",
        sumKey: "myTotalAmount",
        countKey: "myQuantity",
    },
]