
export const mainArray = [
    {
        title: "ورق ها", id: 1,
        subMenu: [
            {title: "ورق پلکسی ", id: 1,
            productList : [
                {productCode:"", name:"",},
            ]
            },
            {title: "استیل", id: 2,},
            {title: "آهن", id: 3,},
            {title: "آلومینیوم", id: 4,},
            {title: "پی وی سی", id: 5,},
        ],
    },
    {
        title: "لبه ها", id: 2,
        subMenu: [
            {title: "چلنیوم ", id: 1,},
            {title: "سوئدی", id: 2,},
            {title: "پلکسی", id: 3,},
            {title: "استیل", id: 4,},
            {title: "آهن", id: 5,},
        ],
    },
    {
        title: "چسب ها", id: 3,
        subMenu: [
            {title: "123 درجه یک ترک (متر)", id: 1,},
            {title: "کلر فرم برای دوبل پلکسی (متر بر خط)", id: 2,},
            {title: "چسب کلرسفت برای لبه پلاستیک (متربرخط)", id: 3,},
            {title: "آکواریوم برای محکم کردن حروف (متربرخط)", id: 4,},
            {title: "پولی اورتان برای محکم کردن حروف (متربرخط)", id: 5,},
            {title: "پولی اورتان برای چسباندن استیل و فلز به پلکسی (مساحت قطعه)", id: 6,},
        ],
    },
    {
        title: "اجرت برش", id: 4,

        subMenu: [
            {title: "برش پلکسی ", id: 1,},
            {title: "برش فلزات ( فایبر )", id: 2,},
            {title: "برش سی ان سی ( مته )", id: 3,},
            {title: "برش پی وی سی", id: 4,},
            {title: "برش ام دی اف", id: 5,},
        ],
    },
    {
        title: "اجرت ساخت", id: 5,
        subMenu: [
            {title: "چلنیوم آسان و سخت", id: 1,},
            {title: "سوئدی آسان و سخت", id: 2,},
            {title: "پلاستیک آسان و سخت و کاردستی", id: 3,},
            {title: "+ پلاستیک مولتی بند  آسان و سخت و کاردستی", id: 4,},
            {title: "جوش استیل آسان و سخت", id: 5,},
            {title: "جوش آهن آسان و سخت", id: 6,},
            {title: "جوش فایبر آسان و سخت", id: 7,},
            {title: "المان شهری، آسان و سخت و کاردستی", id: 8,},
        ],

    },
    {
        title: "دوبل و خدمات  متفرقه", id: 6,
        subMenu: [
            {title: "دوبل پلکسی", id: 1,},
            {title: "پوست کن کردن لبه و پلکسی و سلفون کردن روی کار", id: 2,},
            {title: "پلات نصب ( متر طول کاغذ )", id: 3,},
            {title: "پیچ نصب حروف به تعداد لازم", id: 4,},
            {title: "تغییر سیم سیم کشی به 50 سانتی متری", id: 5,},
            {title: "تغییر سیم سیم کشی به 75 سانتی متری", id: 6,},
            {title: "تغییر سیم سیم کشی به 100 سانتی متری", id: 7,},
        ],
    },
    {
        title: "اس ام دی ( نور)", id: 7,
        subMenu: [
            {title: "اس ام دی رزین چهار مقاومت ", id: 1,},
            {title: "اس ام دی اینجکشن اکونومی", id: 2,},
            {title: "اس ام دی اینجشمن سامسونگ", id: 3,},
            {title: "اس ام دی اینجشن 220 ولت", id: 4,},
        ],
    },
]
